{"scoring":null,"notes":"","legend":"\\textbf {This problem is interactive. If you are not familiar with this type of problem, you can first check the guide. In general, you must flush the buffer of the standard output each time you interact before you can read the answer from the standard input of the judge program.\\url{https://codeforces.com/blog/entry/45307}}\r\n\r\nFontaine has a prophecy that reads roughly as follows: the water levels in Fontaine will rise, and all the people with sin will be drowned and dissolved, with only the Hydro Archon, Furina, remaining, weeping on her throne.\r\n\r\nNow we know that all of this is due to a huge narwhal in Primordial Sea, All-Devouring Narwhal. When it is big enough, it will cause the Primordial Sea water to leak.\r\n\r\n\\begin{center}\r\n  \\includegraphics[scale=0.4]{whale.jpg} \\\\\r\n  \\small{All-Devouring Narwhal}\r\n\\end{center}\r\n\r\nFocalors has mastered the function $f(t)$ of the All-Devouring Narwhal's size changing with time, and the minimum size $k$ that causes the water of Primordial Sea water to leak.\r\n\r\nNow it is known that $f(t)$ is a strictly increasing and differentiable function, and the function value at some point in $(0, 100)$ is equal to $k$. However, Focalors does not master the closed form of the function. She can only calculate $f(t)$ based on a certain $t$, and cannot derive or do other operations.","authorLogin":"CaveNightingale","language":"english","timeLimit":1000,"output":"","inputFile":"stdin","outputFile":"stdout","input":"\\textbf{The judge program for this problem does not support scientific notation.}\r\n\r\nA finite decimal $k$ represents the minimum body size that causes the Primordial Sea to leak. ($1 \\le k \\le 100$)","authorName":"Huabin Yuan","sampleTests":[{"output":"\r\n? 71\r\n\r\n? 70.75\r\n\r\n? 70.7107\r\n\r\n! 70.7107","input":"50\r\n\r\n50.41\r\n\r\n50.055625\r\n\r\n50.0000309449","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Prophecy of Fontaine","interaction":"Your program needs to interact with the judge program to complete the task, output content to the judge program using standard output, and read data from the judge program using standard input.\r\n\r\nThere are two types of content you can output to the judge program:\r\n\r\n\\begin{itemize}\r\n\\item ? $t$, where $t$ is a finite decimal, indicating the value of $f(t)$ to be queried. ($0 \\le t \\le 100$) \\\\\r\nThe judge program will respond with a finite decimal $f(t)$, with an error not exceeding $10^{-12}$. ($0 \\le f(t) \\le 1000$)\r\n\\item ! $t_0$, where $t_0$ is a finite decimal, indicating the root of $f(t) = k$. ($0 \\le t_0 \\le 100$) \\\\\r\nAfter sending this message to the judge program, your program should exit immediately, and the judge program will determine whether your answer is correct.\r\n\\end{itemize}\r\n\r\nYour answer $t_0$ will be accepted if and only if it meets at least one of the following conditions: ($t^*$ represents the correct answer)\r\n\\begin{itemize}\r\n\\item $|t_0 - t^*| \\le 10^{-4}$\r\n\\item ${|t_0 - t^*| \\over |t^*|} \\le 10^{-4}$\r\n\\item $|f(t_0) - k| \\le 10^{-4}$\r\n\\item ${|f(t_0) - k| \\over |k|} \\le 10^{-4}$\r\n\\end{itemize}\r\n\r\nIf the interaction format is incorrect or the final answer is not accepted, the verdict will be Wrong Answer.\r\n\r\nIn addition, your program can interact up to $100$ times at most, otherwise the verdict will be Partial Correct. If the interaction exceeds $100$ times, $20\\%$ of the score for that test point will be deducted, and $10\\%$ of the score will be deducted for each $10$ additional interaction until no points remain.","memoryLimit":268435456,"tutorial":""}